TOKEN = "6333700659:AAHI1d1K-WbKQq4IXSb23rSNeOShPZZCbZg"
ADMIN_ID = 6335987620
GROUP_LINK = "https://t.me/+Z2dJLGrGRVdmM2Yy"
CONTACT_PHONE = "https://t.me/KaSSa_4444"

CARD_NUMBER = """
Приват : 5457 0825 1854 3470
Ощад : 4790 7299 2105 9994

Мінімальний платіж 200 грн
Мінімальний вивід 400 грн

Зверніть увагу, що касир доступний з 9:00 до 00:00
Іноді довше
"""

HALP = """
Для того, щоб зробити ставку натисніть кнопку «💳Номер карти💳»...
"""

AK1 = """Щоденна акція ..."""
AK2 = """⚡️У нас є віртуальний сейф..."""
AK3 = """Cash Back ..."""

DEMO = """
🎉 Чемпіон 🎉
Тут ви можете безкоштовно зіграти...
https://spinplanet.net/?login_code=00000000000000
"""

LINK1 = "💵💵💵 Чемпіон💵💵💵 скористайтеся ботом..."
LINK2 = "🍀🍀🍀Cуперматік🍀🍀🍀 https://bit.ly/3Lppt0z"
LINK3 = "Або відправте код у цей чат..."

REF = """
⚡️Відправте ваш код у бот...
"""
