# config.py

# Токен
TOKEN = '6333700659:AAHI1d1d1-KbKQq4IXSb23rSNeOShPZZCbZg'

# Група та контактні дані
GROUP_LINK = 'https://t.me/+Z2dJLGrGRVdmM2Yy'
CONTACT_PHONE = 'https://t.me/KaSSa_4444'
CARD_NUMBER = """
Приват : 5457 0825 1854 3470
Ощад : 4790 7299 2105 9994

Мінімальний платіж 200 грн
Мінімальний вивід 400 грн

Зверніть увагу, що касир доступний з 9:00 до 00:00
Іноді довше
"""

# Тексти
HALP = """Для того, щоб зробити ставку натисніть кнопку 
«💳Номер карти💳»,
Вам прийдуть актуальні реквізити.
..."""

AK1 = """Щоденна акція 
Після того як ви зіграли..."""

AK2 = """⚡️У нас є віртуальний сейф..."""

AK3 = """Cash Back (страхувальна сума)..."""

DEMO = """ 🎉 Чемпіон 🎉
Тут ви можете безкоштовно зіграти...
"""

LINK1 = """💵💵💵 Чемпіон💵💵💵
скористайтеся ботом щоб зробити ссилку
"""

LINK2 = """🍀🍀🍀Cуперматік🍀🍀🍀
Щоб зайти в гру введіть код тут - https://bit.ly/3Lppt0z
"""

LINK3 = """Або відправте код у цей чат
00-00-00-00-00-00-00
"""

REF = """⚡️Відправте ваш код в чат у цьому боті
00-00-00-00-00-00-00
..."""
